const ha = ["ه","(ه|ة)"]

exports.greeting = [
    "اهلا",
    "اهلا وسهلا",
    "السلام عليكم",
    "سلام عليكم",
    "السلام عليكم ورحمة الله",
    "سلام عليكم",
    "السلام عليكم ورحمة الله وبركاته",
    "تحيه",
    "صباح الخير",
    "مرحب",
    "مرحبا",
    "مساء النور",
    "هلا",
    "هلا ومرحب",
].map(item => item.replace(ha[0], ha[1]))

exports.reject = [
    "رفض",
    "غير ممكن",
    "غير مهتم",
    "غير موافق",
    "لا",
    "لا ارغب",
    "لا اريد",
    "لا خلاص",
    "لا شكرا",
    "لو سمحت لا",
    "مش عايز",
    "من فضلك لا",
].map(item => item.replace(ha[0], ha[1]))

exports.thank = [
    "انا اشكرك",
    "اشكرك",
    "اشكرك جدا",
    "تمام شكرا",
    "حسنا شكرا",
    "شكر",
    "شكر خاص",
    "شكرا",
    "شكرا جدا",
    "شكرا جزيلا",
    "شكرا لك",
    "شكرا لمساعدتك",
    "شكرا مره اخرى",
    "متشكر",
    "متشكر جدا",
].map(item => item.replace(ha[0], ha[1]))

exports.accept = [
    "اكيد",
    "اكيد طبعا",
    "اوك",
    "اه",
    "تمام",
    "حسنا",
    "خلاص ماشي",
    "طبعا",
    "قبول",
    "ماشي",
    "موافق",
    "نعم",
].map(item => item.replace(ha[0], ha[1]))

exports.help = [
    "احتاج اليك",
    "احتاج مساعدتك",
    "الاعلان لم يتم عرضه",
    "انا احتاج مساعده",
    "حد يساعدني",
    "حد يقدر يساعدني",
    "ساعدني",
    "عايز مساعده",
    "عايزك تساعدني",
    "عندي مشكله",
    "عندي مشكله في الدفع",
    "محتاج بعض المساعده",
    "محتاج مساعده",
    "مساعده",
    "ممكن تساعدني",
    "هتساعدني",
].map(item => item.replace(ha[0], ha[1]))

exports.leave = [
    "اراك لاحقا",
    "باي",
    "مع السلامه",
    "وداع",
].map(item => item.replace(ha[0], ha[1]))

exports.quit = [
    "اغلق",
    "اقفل",
    "اسكت",
    "امشي",
    "مش محتاج مساعده",
    "انا خلصت",
].map(item => item.replace(ha[0], ha[1]))

exports.ad_issue = [
    "اعلان",
    "الاعلان",
    "معلن",
    "اعلانه",
    "يعلن",
    "منتج",
    "سيارات",
    "سياره",
    "عقارات",
    "عقار",
    "اكسسوارات",
    "اكسسوار",
    "مستلزمات",
    "طبيه",
    "موبايلات",
    "موبايل",
    "اجهزه",
    "منزليه",
    "اكترونيات",
    "اثاث",
    "منزلي",
].map(item => item.replace(ha[0], ha[1]))

exports.payment_issue = [
    "دفع",
    "ممول",
    "كاش",
    "فودافون",
    "فودافون كاش",
    "اعلان ممول",
    "الاعلان الممول",
].map(item => item.replace(ha[0], ha[1]))